{
  "Blowing Or Drifting Snow": [
    "Stay inside and build a cozy reading corner—pillows, blanket, low light.",
    "Put on a long instrumental playlist and reorganize your room or desk.",
    "Journal about a time you felt completely disconnected from the world—like now.",
    "Do a deep, intentional tidy-up of one forgotten drawer or shelf.",
    "Write a short story that starts with a blizzard and ends in a memory."
  ],
  "Heavy Snow": [
    "Watch a long film or mini-series you've been putting off.",
    "Make a big one-pot meal and let it simmer while the snow piles up.",
    "Bundle up and take a short walk—notice how quiet the world becomes.",
    "Start a slow project like a puzzle, collage, or knitting.",
    "Write about a winter memory from your childhood, as vividly as you can."
  ],
  "Light Snow": [
    "Sit by the window and sketch what you see in black and white.",
    "Take a short walk and try to notice how the snow changes familiar places.",
    "Read a poem out loud that fits the weather—or write your own.",
    "Make a cup of tea and just sit, with no distractions, for 10 minutes.",
    "Write a letter or email to someone you haven't spoken to in too long."
  ],
  "Snow": [
    "Cook a slow breakfast and savor the process—pancakes, oatmeal, eggs.",
    "Wrap yourself in your thickest blanket and revisit a favorite book.",
    "Start a playlist with songs that feel like falling snow.",
    "Write a journal entry about what feels still in your life—and what doesn't.",
    "Make a homemade snack and share it with someone if you can."
  ],
  "Snow Showers": [
    "Go on a short walk and take note of how the weather shifts.",
    "Read something immersive—fiction, biography, or a longform article.",
    "Light a candle and write without editing for 20 minutes.",
    "Try drawing or painting with only grayscale tones.",
    "Do a simple indoor stretch routine to shake off the stillness."
  ],
  "Snow And Rain Showers": [
    "Wrap yourself in a hoodie and listen to ambient rain/snow sounds.",
    "Try writing a scene from a novel set on a day like today.",
    "Make soup and let yourself do nothing while it simmers.",
    "Draw or doodle with no plan—just follow the shapes that come.",
    "Organize something visual: bookshelf, photo folder, wardrobe colors."
  ],
  "Freezing Fog": [
    "Take a short, quiet walk if safe—treat it like a meditation.",
    "Write about something unclear in your life, and why it's hard to see.",
    "Listen to ambient or instrumental music and sketch from imagination.",
    "Create a fog-themed photo using light, blur, or filters indoors.",
    "Read something surreal or atmospheric—let your mind wander."
  ],
  "Heavy Freezing Rain": [
    "Create a little indoor ritual: music, tea, journaling, no screens.",
    "Watch a nature documentary and let it pull you into a different world.",
    "Light a candle and write as if you're sending a letter from isolation.",
    "Do something repetitive and calming: baking, sweeping, folding.",
    "Read something physical—an actual book or magazine."
  ],
  "Light Freezing Rain": [
    "Write a journal entry while listening to rain sounds or lo-fi beats.",
    "Do a few gentle stretches with the intention of warming up slowly.",
    "Write out your goals—but make them softer, kinder, more forgiving.",
    "Make something warm to eat and eat it slowly, without multitasking.",
    "Call or voice-note someone you've been thinking about."
  ],
  "Freezing Drizzle/Freezing Rain": [
    "Reflect in writing: What's been foggy or hard to navigate lately?",
    "Do a one-hour digital detox—phone off, just be present.",
    "Write a short, eerie winter story or sketch an imaginary ice world.",
    "Make a warm beverage and design your ideal 'snowed-in' day.",
    "Listen to a slow album start-to-finish with headphones."
  ],
  "Light Freezing Drizzle/Freezing Rain": [
    "Play a board game—even if it's solo—or try a brain teaser.",
    "Write a short letter to your future self—keep it honest.",
    "Do a small home task you've been avoiding, like sorting receipts.",
    "Wrap yourself in a blanket and do nothing—on purpose.",
    "Revisit a creative project you paused or forgot about."
  ],
  "Heavy Freezing Drizzle/Freezing Rain": [
    "Create a cozy cave: layers, warm drink, and your favorite chair.",
    "Work on a slow craft—knitting, journaling, collage, or hand lettering.",
    "Read a book in the bathtub or a blanket pile.",
    "Put on a podcast and clean something no one sees but you appreciate.",
    "Write a scene set in extreme weather—realistic or sci-fi."
  ],
  "Ice": [
    "Move intentionally: stretch, breathe, and slow everything down.",
    "Spend 15 minutes editing your digital clutter—notes, photos, files.",
    "Wrap up and plan a week of simple, doable personal rituals.",
    "Sketch an abstract pattern inspired by cold, tension, or stillness.",
    "Read or listen to something cold-themed and reflect on what freezes you emotionally."
  ],
  "Diamond Dust": [
    "Take a brief walk and watch how the air sparkles—really look.",
    "Photograph something small and beautiful with intention.",
    "Write a poem or paragraph about what it means to shimmer quietly.",
    "Start a collage or visual piece using only white, silver, and gray.",
    "Sit still, breathe deeply, and just observe light for five minutes."
  ],
  "Rain": [
    "Make a cup of tea and watch the rain fall without doing anything else.",
    "Listen to your favorite album start to finish—no skipping.",
    "Write a memory that happened on a rainy day from your past.",
    "Open a window just enough to hear the rain while reading or sketching.",
    "Cook something from scratch that takes at least an hour and makes your place smell amazing."
  ],
  "Heavy Rain": [
    "Stay in, dim the lights, and binge a show or movie you've never started.",
    "Journal about something heavy you've been carrying—get it out.",
    "Play rain-compatible music (jazz, lo-fi, ambient) and clean slowly.",
    "Write a letter to someone who's far away—even if you never send it.",
    "Light a candle and meditate for 10 minutes while listening to the storm."
  ],
  "Light Rain": [
    "Take a short walk with an umbrella—just to feel the air.",
    "Read in a café or by the window with a hot drink.",
    "Sketch or watercolor something abstract inspired by the sound of rain.",
    "Call someone for no reason other than to check in.",
    "Reorganize a small part of your space you normally ignore."
  ],
  "Rain Showers": [
    "Pause your day for a 'rain break'—step outside or sit near the window.",
    "Write a short scene or paragraph set during a sudden downpour.",
    "Put on a rain-themed playlist and zone out or reflect.",
    "Try a slow yoga or mobility routine while the rain taps the windows.",
    "Write a list of comforting things you'd pack in a rainy-day survival kit."
  ],
  "Heavy Drizzle": [
    "Slow cook something rich—stew, curry, chili—and savor the wait.",
    "Write something slow and sad and beautiful, even if it makes no sense.",
    "Work through a backlog of saved articles or essays you've ignored.",
    "Create a minimalist drawing using only one color.",
    "Listen to rain sounds + piano music while lying down with your eyes closed."
  ],
  "Drizzle": [
    "Walk outside without your phone and let the rain clear your head.",
    "Clean your space silently—no distractions, just rhythm.",
    "Write a list of things that bring you comfort, big or small.",
    "Revisit something you almost finished—project, book, playlist—and complete it.",
    "Let yourself stare out the window and do nothing productive."
  ],
  "Light Drizzle": [
    "Brew a favorite drink and sip it slowly without any screens.",
    "Sit by a window and sketch or trace the outline of your view.",
    "Write a fictional dialogue between two strangers stuck in the drizzle.",
    "Do a 15-minute body scan meditation—just feel where you are.",
    "Reorder or re-shelve your books, albums, or notes by vibe instead of title."
  ],
  "Heavy Drizzle/Rain": [
    "Pretend you're in a rainy film scene—do something dramatic and slow.",
    "Sort old digital photos and delete duplicates while listening to moody music.",
    "Read something indulgent or nostalgic from your past.",
    "Cook a one-pan dinner and dance in your kitchen while it simmers.",
    "Write a dramatic, over-the-top weather report for your day."
  ],
  "Light Drizzle/Rain": [
    "Make a small ritual of tidying, stretching, and soft music.",
    "Write 5 kind things about yourself in a notebook.",
    "Step outside for 2 minutes and focus only on the sensations.",
    "Do a solo tea ceremony—simple, quiet, present.",
    "Look through old messages or letters and reflect on what's changed."
  ],
  "Precipitation In Vicinity": [
    "Take a moment to observe the weird in-between-ness of the day.",
    "Write something surreal: what if the rain is trying to tell you something?",
    "Make a list of things you're in the middle of—not started or finished.",
    "Create a short soundscape playlist that matches this ambiguous weather.",
    "Draw or write something that captures uncertainty without fixing it."
  ],
  "Thunderstorm": [
    "Put on dramatic music and let yourself move—dance, stretch, or clean like a storm.",
    "Write a monologue from the perspective of someone caught in a thunderstorm.",
    "Unplug for an hour and journal about what you've been avoiding.",
    "Make something with your hands—clay, collage, pen and paper—fast and messy.",
    "Watch a film that reflects the mood—moody, charged, emotional."
  ],
  "Thunderstorm Without Precipitation": [
    "Sit in darkness or low light and just listen—let your mind wander.",
    "Write a short story or scene about tension with no visible cause.",
    "Read something poetic or mystical—lean into the strange atmosphere.",
    "Start a playlist that feels like unresolved energy or anticipation.",
    "Practice breathwork or a guided meditation to ground yourself."
  ],
  "Lightning Without Thunder": [
    "Watch the sky carefully—every flash is a visual poem.",
    "Journal about something you've sensed but not understood.",
    "Write a one-sentence thought every time you see lightning.",
    "Turn off all music and devices—just observe.",
    "Create a minimalist drawing or abstract sketch inspired by light."
  ],
  "Squalls": [
    "Find shelter, sit still, and let the chaos pass—inside and out.",
    "Write a single paragraph full of emotional intensity—then stop.",
    "Listen to aggressive or high-energy music and purge your mind.",
    "Sketch or write quickly and furiously for five minutes—no edits.",
    "Make tea or a snack and do absolutely nothing for the next 30 minutes."
  ],
  "Hail": [
    "Record the sound of the hail and loop it with ambient music.",
    "Draw or photograph textures around your home that feel 'cold' or 'hard'.",
    "Write a piece that starts soft and ends sharp—reflecting the contrast.",
    "Stay in and clean something you've avoided forever.",
    "Start a strange side project you've never let yourself explore."
  ],
  "Hail Showers": [
    "Make a soundscape playlist that starts calm, builds chaos, and returns to stillness.",
    "Read something dense or complex—lean into the mental challenge.",
    "Write a micro-story (under 100 words) about a wild storm.",
    "Organize a small part of your space with intensity and purpose.",
    "Light a candle and reflect on the contrast between shelter and exposure."
  ],
  "Funnel Cloud/Tornado": [
    "Create a 'go bag' or checklist—even if symbolic—of what you'd keep in a crisis.",
    "Write a letter as if today were the end of the world. Be honest.",
    "Draw a chaotic spiral or map your emotions without words.",
    "Find the most peaceful spot in your home and sit in total silence for 10 minutes.",
    "Listen to something grounding while lying down, no phone, eyes closed."
  ],
  "Fog": [
    "Take a walk and notice how the fog turns everything familiar into something new.",
    "Make a small creative piece that feels dreamy—draw, write, or take a photo.",
    "Have a quiet breakfast with soft music and no phone—just presence.",
    "Rewatch a film you love and notice new details.",
    "Organize a playlist of songs that make you feel light, not heavy."
  ],
  "Mist": [
    "Go outside and take a photo that captures the mood without filters.",
    "Make a spontaneous 'feel-good' playlist and dance to one song immediately.",
    "Clean a surface until it shines—then light a candle or place a plant there.",
    "Write down three things that made you smile in the last week.",
    "Try a new recipe with ingredients you already have—get creative, not perfect."
  ],
  "Smoke Or Haze": [
    "Do something tactile and creative—clay, cutting, sketching, sorting photos.",
    "Watch a nature documentary and remind yourself the sky will clear.",
    "Listen to upbeat world music you've never heard before and move with it.",
    "FaceTime or call someone and talk about something dumb and joyful.",
    "Reorganize your closet or drawers and rediscover something you forgot you loved."
  ],
  "Dust storm": [
    "Create a cozy hideout inside: blanket, tea, something good to read or watch.",
    "Write down five things you're grateful for, big or small.",
    "Write a letter or postcard to someone, even if you never send it.",
    "Print or draw a simple coloring page and fill it in with unusual colors.",
    "Listen to music that makes you feel grounded and do a simple stretch routine.",
    "Organize a corner of your space that needs love, like a desk or drawer.",
    "Start a creative project that doesn't require perfection—just start making.",
    "Organize your spice rack, and then cook something with what you rediscover.",
    "Make a list of places you want to visit and research one in detail—write down what you'd do there."
  ],
  "Clear": [
    "Go outside and trace a new walking route using only turns you've never taken before.",
    "Sit somewhere in the sun and eat a colorful piece of fruit—no phone, just taste and light.",
    "Clean your sunglasses, grab your camera or phone, and take five color-themed photos.",
    "Do a 10-minute body stretch while facing direct sunlight—absorb it like a solar panel.",
    "Make a list of 10 things you're proud of and read it out loud to yourself in the sun."
  ],
  "Sky Coverage Decreasing": [
    "Take a before-and-after photo of the sky and journal what else in your life is shifting.",
    "Start a playlist that begins soft and gets brighter—then go for a walk and time the mood shift.",
    "Write a short message to someone you haven't talked to lately—just say something kind.",
    "Find a café, bench, or window where the light is shifting and sketch the sky for 5 minutes.",
    "Rearrange a small part of your room to reflect something new coming into your life."
  ],
  "Sky Unchanged": [
    "Pick one simple task you've been avoiding and finish it completely. Then celebrate it.",
    "Bake something small and satisfying—like muffins, banana bread, or roasted nuts.",
    "Write down three routines you want to improve, and one you want to break entirely.",
    "Take a walk or sit outside and count how many colors you can find in the landscape.",
    "Do a 10-minute 'one-room reset'—tidy, air out, and light something pleasant like incense or citrus peel."
  ],
  "Overcast": [
    "Take yourself on a 'gray walk'—try to find and photograph five different shades of gray in the world around you.",
    "Choose one book, album, or film you keep putting off and commit to finishing it today.",
    "Make a cup of something warm and rearrange your creative tools or desk setup.",
    "Write a note to your future self for the next rainy day—hide it somewhere you'll forget.",
    "Put on soft music and do a slow task with full focus: folding clothes, slicing vegetables, washing dishes."
  ],
  "Partially cloudy": [
    "Lie on your back and watch the sky shift—set a timer for 10 minutes and just look up.",
    "Write a two-sentence short story inspired by the clouds overhead.",
    "Pick a small habit you want to change and design a sticky note that reminds you of it—put it where it matters.",
    "Go outside and try to match the sky's mood with an outfit, a playlist, or a photo.",
    "Take a walk and deliberately notice the shadows—where they fall, what they touch, how they move."
  ],
  "Sky Coverage Increasing": [
    "Play your favorite bright, sunny song and dance to it as the clouds roll in—celebrate contrast.",
    "Pick something you've been meaning to put away, fix, or delete—and do it now.",
    "Make a 3-item 'feel better' list for yourself and check off just one thing from it.",
    "Write a haiku or short poem about change, uncertainty, or the sky itself.",
    "Take a photo of the sky now, then again in an hour, and caption them with two different moods."
  ]
}